01  WS-AREA-1 PIC X(100). 
01  WS-AREA-2 PIC 9(5). 

PROCEDURE DIVISION.
    MOVE 'some string' TO WS-AREA-1
    MOVE 12345 TO WS-AREA-2
    DISPLAY WS-AREA-1 WS-AREA-2
    STOP RUN.